app/views/articles/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ?  [["article_id", 15]]
---
  <%= link_to c.name, "/by_category?id=#{c.id}", class: "link-color" %>
  <%=(i==(@article.categories.length-1) ? '' : ', ')%>

SELECT "votes".* FROM "votes" WHERE "votes"."article_id" = ? ORDER BY "votes"."id" ASC LIMIT ?  [["article_id", "15"], ["LIMIT", 1]]
---
<p>
<strong>total votes:</strong> <%=@article.votes.length%>