app/helpers/articles_helper.rb

SELECT "articles".* FROM "articles" INNER JOIN "article_categories" ON "articles"."id" = "article_categories"."article_id" WHERE "article_categories"."category_id" = ?  [["category_id", 1]]
SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def recent_article_by_category(category_id)
        Category.find(category_id).articles.max_by{|ar| ar.created_at}