app/helpers/sessions_helper.rb

  def current_user
    return unless (user_id = cookies.signed[:user_id])

    user = User.find_by(id: user_id)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]