app/controllers/articles_controller.rb

SELECT "categories".* FROM "categories" ORDER BY "categories"."priority" ASC
---
  def index
    @categories = Category.all.by_priority

INSERT INTO "articles" ("user_id", "title", "text", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", "1"], ["title", "asdf"], ["text", "hello world"], ["created_at", "2020-03-26 22:52:01.854293"], ["updated_at", "2020-03-26 22:52:01.854293"], ["picture", nil]]
UPDATE "articles" SET "updated_at" = ? WHERE "articles"."id" = ?  [["updated_at", "2020-03-27 02:06:25.310088"], ["id", 15]]
INSERT INTO "articles" ("user_id", "title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "1"], ["title", "first article"], ["text", "Hello world, this is my first article"], ["created_at", "2020-03-26 21:23:40.482757"], ["updated_at", "2020-03-26 21:23:40.482757"]]
INSERT INTO "articles" ("user_id", "title", "text", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", "1"], ["title", "oscar"], ["text", "my name is oscar"], ["created_at", "2020-03-26 22:47:49.222942"], ["updated_at", "2020-03-26 22:47:49.222942"], ["picture", nil]]
INSERT INTO "article_categories" ("article_id", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["article_id", 22], ["category_id", 2], ["created_at", "2020-03-29 12:49:16.219134"], ["updated_at", "2020-03-29 12:49:16.219134"]]
---
  def create
    @article = Article.create(title: params[:title], text: params[:text], user_id: current_user.id, image: params[:image])
  if @article.image.attached? && @article.valid? && !params[:category_ids].nil?
    @article.save
    params[:category_ids].each do |category_id|
      ac = ArticleCategory.new(category_id: category_id, article_id: @article.id)
      ac.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
INSERT INTO "votes" ("user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", "1"], ["article_id", "15"], ["created_at", "2020-03-27 22:23:22.778387"], ["updated_at", "2020-03-27 22:23:22.778387"]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."article_id" = ? ORDER BY "votes"."id" ASC LIMIT ?  [["article_id", "15"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def show
    @article=Article.find(params[:id])
    if params[:vote]=='1'
      vote = Vote.new(user_id: current_user.id, article_id: @article.id)
      vote.save
    elsif params[:vote]=='0'
      Vote.destroy(@article.votes.first{|v| v.user_id==current_user.id}.id)