app/controllers/articles_controller.rb

  def show
    @article=Article.find(params[:id])
    @list_categories = []
    if params[:vote]!=nil
      vote = Vote.new(user_id: current_user.id, article_id: @article.id)
      vote.save
---
INSERT INTO "votes" ("user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", "3"], ["article_id", "17"], ["created_at", "2020-03-28 18:21:26.326527"], ["updated_at", "2020-03-28 18:21:26.326527"]]