app/controllers/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "remember_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.create(name: params[:name],
                        email: params[:email],
                        password: params[:password],
                        password_confirmation: params[:password_confirmation])